# Задание 2
print("Введите строку: ")
a = input(str())
print('Общее количество символов =', len(a))

# Временная сложность алгоритма O(1)